Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes.MinimalDistance Property
 Gets or sets the minimal distance for placing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double MinimalDistance { get; set; }
Public Property MinimalDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PlacingDistanceAttributes Class
Tekla.Structures.Drawing Namespace